tutorials/Aerothermal/UBend/run/0.orig/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 2000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2000;
    }

    outlet
    {
        type            zeroGradient;
    }

    sym
    {
        type            symmetry;
    }

    ubend
    {
        type            MarshakRadiation;
        value           uniform 0;
    }

    ubendup
    {
        type            MarshakRadiation;
        value           uniform 0;
    }

}

// ************************************************************************* //

